# Задача 4: Петя, Катя и Сережа делают из бумаги журавликов. Вместе они сделали S журавликов. 
# Сколько журавликов сделал каждый ребенок, если известно, что Петя и Сережа сделали одинаковое 
# количество журавликов, а Катя сделала в два раза больше журавликов, чем Петя и Сережа вместе?

# *Пример:*

# 6 -> 1  4  1
# 24 -> 4  16  4
#     60 -> 10  40  10
#     7 -> "нельзя определить"

number_cranes = int(input("Введите количество журавликов: "))
if number_cranes % 6 == 0:
    petya = sergey = number_cranes // 6
    katya = (petya + sergey) * 2
    print(petya, sergey, katya)
else:
    print("нельзя определить")