# Задача 6: Вы пользуетесь общественным транспортом? Вероятно, вы расплачивались за проезд и получали билет
# с номером. Счастливым билетом называют такой билет с шестизначным номером, где сумма первых трех цифр равна
# сумме последних трех. Т.е. билет с номером 385916 – счастливый, т.к. 3+8+5=9+1+6. Вам требуется написать
# программу, которая проверяет счастливость билета.

# *Пример:*

# 385916 -> yes
# 123456 -> no

ticket_number = input('Введите номер билета: ')
first = 0
second = 0
for i in range(len(ticket_number)//2):
    first += int(ticket_number[:3:1][i])
    second += int(ticket_number[3:6:1][i])
if first == second:
    print('Ура, счастливый билет')
else:
    print('Не повезло')